quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3/AMP01V11A3 - 副本 (2).C
#ifdef AMP01V11A3

#include "AMP01V11A3.H"


//#include	"AMP_Protocol.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"
#include "STM32_SPI.H"

#include "SWITCHID.H"
#include "IOT5302W.H"     //读卡器

#include 	"CRC.H"

#include "string.h"				//串和内存操作函数头文件

//------------------锁接口J10
#define ampSYSLEDPort    GPIOA         //锁控制接口，高电平开锁
#define ampSYSLEDPin     GPIO_Pin_0
//------------------通讯接口--PC
#define ampCommPcPort        USART2
//------------------通讯接口--柜口
#define ampCommCbPort       USART1
#define ampCommCbCTLPort    GPIOA         //锁控制接口，高电平开锁
#define ampCommCbCTLPin     GPIO_Pin_8
//------------------通讯接口--层板接口
#define ampCommLayPort       UART4
#define ampCommLayCTLPort    GPIOA         //锁控制接口，高电平开锁
#define ampCommLayCTLPin     GPIO_Pin_12
//------------------通讯接口--读卡器接口
#define ampCommCardPort      USART3
#define ampCommCardCTLPort   GPIOC         //锁控制接口，高电平开锁
#define ampCommCardCTLPin    GPIO_Pin_8
#define ampCommCardBaudRate  19200         //读卡器通讯波特率

//------------------锁接口J10
#define ampLockDrPort    GPIOB         //锁控制接口，高电平开锁
#define ampLockDrPin     GPIO_Pin_1
#define ampLockSiPort    GPIOC         //锁信号，检测到低电平表示锁已开
#define ampLockSiPin     GPIO_Pin_12
#define ampUnLock        ampLockDrPort->BSRR  = ampLockDrPin    //开锁
#define ampResLock       ampLockDrPort->BRR   = ampLockDrPin    //释放锁驱动
#define ampGetLockSts    (ampLockSiPort->IDR & ampLockSiPin)      //获取锁的状态，如果为0，表示锁已开
//------------------背光接口J11的VCC和EN脚
#define ampBackLightPort GPIOB         //高电平关闭，低电平点亮
#define ampBackLightPin  GPIO_Pin_0
#define ampBakkLightOff	(ampBackLightPort->BRR 	= ampBackLightPin)
#define ampBakkLightOn	(ampBackLightPort->BSRR = ampBackLightPin)

//------------------层板电源控制J5、J6、J9共用一个控制电源
#define ampLayPowerPort  GPIOB         //高电启动电源，低电平关闭电源
#define ampLayPowerPin   GPIO_Pin_2
#define ampLayPowerOn    ampLayPowerPort->BSRR = ampLayPowerPin   //启动电源
#define ampLayPowerOff   ampLayPowerPort->BRR  = ampLayPowerPin   //关闭电源

#define ampReSendTime					100		//ms
#define ampUnlockOuttime   		2000      	//开锁倒计时超时时间
#define ampMaxResendCount  		5         	//最大发送次数
/* Private variables ---------------------------------------------------------*/

static RS485Def ampRS485Ly;   //uart4,PA15   //层板接口
static RS485Def ampRS485Cb;   //usart1,PA8    //副柜接口
//static RS485Def ampRS485Card; //usart3,PB2    //读卡器接口
static SwitchDef ampSwitchID;
static SPIDef stLed;

ampdef ampsys;



void pc_data_process(unsigned char* pBuffer,unsigned short len);
static void cmd_process(ampphydef* frame);
static void amp_ack_up(ampPortDef port);
static void amp_ack_down(ampPortDef port);
static char is_ack_frame(unsigned char* pBuffer,unsigned short len);
static void Set_Lock_Open(void);
static void Led_Server(void);
static void Pc_Server(void);

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01V11A3_Configuration(void)
{	
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	
	
	Hardware_Configuration();

  GPIO_Configuration_OPP50(ampSYSLEDPort,ampSYSLEDPin);

	//SysTick_DeleymS(500);				//SysTick延时nmS
  PWM_OUT(TIM2,PWM_OUTChannel1,2,500);	//PWM设定-20161127版本	占空比1/1000
	
  IWDG_Configuration(2000);			//独立看门狗配置---参数单位ms
  
  SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
  
  while(1)
  {

  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01V11A3_Server(void)
{ 
	IWDG_Feed();								//独立看门狗喂狗
//	Tim_Server();
//  Lock_Server();
//  SwitchID_Server();
  Led_Server();
	Pc_Server();
//	Cab_Server();
//	Lay_Server();
}
//------------------------------------------------------------------------------





/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static ampCachedef* get_cache_addr(ampPortDef port)
{
	if(NonPort	==	port)
		return 0;
	else if(PcPort	==	port)
		return ampsys.CCdata.pc;
	else if(CabPort	==	port)
		return ampsys.CCdata.cab;
	else if(LayPort	==	port)
		return ampsys.CCdata.lay;
	else
		return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_cache_data(ampPortDef port,ampphydef* frame)
{
	unsigned short	i=0;
	unsigned short  lastarry  = 0;
	unsigned short	len	=	0;
	unsigned char*	pBuffer	=	(unsigned char*)frame;
	ampCachedef* Cache	= get_cache_addr(port);

	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------检查数据有无溢出
	len	=	frame->msg.length+5;	//head,len,crcl.crch.end
	if(maxFramesize<len)
		return 0;
	//-------------------------检查缓存中有无相同数据及查找当前最大缓存序号
	for(i=0;i<maxFramesize;i++)
	{
		if(Cache[i].arry>lastarry)		//缓存数据不为0
		{
			lastarry	=	Cache[i].arry;	//当前最大的序号	
			if(len	==	Cache[i].size)
			{
				if(0  ==  memcmp(Cache[i].data,pBuffer,len)) //比较相同
				{
					return len;		//已有相同数据，退出，表示存储成功
				}
			}
		}
	}
	//-------------------------未在缓存中找到相同的数据
	//-------------------------判断缓存是否为满
	if(lastarry>=ampArrySize)	//从0开始
	{
		//缓存满
		return 0;
	}
	lastarry+=1;
	for(i=0;i<ampArrySize;i++)
  {
    if(0  ==  Cache[i].arry)  //0编号表示此为空缓存
    {
      memcpy(Cache[i].data,pBuffer,len);
      Cache[i].arry = lastarry;             //此缓存在发送队列中的排序
      Cache[i].size = len; 
      return  len;
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static ampCachedef* get_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	unsigned short  lastarry  = 0;
	ampCachedef* Cache	= get_cache_addr(port);
	
