quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3/AMP01V11A3 - 副本 (2).C
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{		
		if(1==Cache[i].arry)		//缓存数据不为0
		{
			return &Cache[i];
		}
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char del_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	ampCachedef* Cache	= get_cache_addr(port);
	
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{
		if((Cache[i].arry))
		{
			Cache[i].arry-=1;
		}
	}
	return 1;
}
//------------------------------------------------------------------------------






/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Pc_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	unsigned short rxnum=0;
	unsigned char rxd[256];
	ampphydef* frame=0;
	//================================================数据接收
	rxnum	=	API_USART_ReadBufferIDLE(ampCommPcPort,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	if(rxnum)
	{
		char ackflag=is_ack_frame(rxd,rxnum);	//1:向上应答，-1：向下应答；0:非应答
		if((-1==ackflag)&&(ampsys.AckW.PC))		
		{
			ampsys.AckW.PC		=	0;
			ampsys.ReSend.Pc	=	0;
			ampsys.time.PcSendTime	=	0;
			del_cache_data(PcPort);
			return;
		}
		else if(0==ackflag)
			pc_data_process(rxd,rxnum);
		return;
	}
	//================================================数据发送
	if(0==ampsys.time.PcSendTime)
	{
		unsigned short sendnum=0;
		ampCachedef*	Cache;
		//----------------------------------------------检查有无应答数据要发送
		if(ampsys.CCdata.PcAck.size)
		{
			Cache	=	&ampsys.CCdata.PcAck;
			sendnum	=	API_USART_DMA_Send(ampCommPcPort,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
			if(sendnum)	//已将数据转移到缓存
			{	
				ampsys.CCdata.PcAck.size	=	0;	//0--无需等待应答，1--需等待应答
				ampsys.time.PcSendTime	=	ampReSendTime;
			}
			return;
		}		
		//----------------------------------------------发送数据
		if(ampsys.ReSend.Pc>ampMaxResendCount)
		{
			ampsys.ReSend.Pc	=	ampMaxResendCount;
			del_cache_data(PcPort);
		}
		Cache	=	get_cache_data(PcPort);
		if(0==Cache)	//无数据
		{
			ampsys.ReSend.Pc	=	0;
			return;
		}
		sendnum	=	API_USART_DMA_Send(ampCommPcPort,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
		if(sendnum)	//已将数据转移到缓存
		{	
			ampsys.AckW.PC	=	1;	//0--无需等待应答，1--需等待应答
			ampsys.ReSend.Pc++;			
			ampsys.time.PcSendTime	=	ampReSendTime;
		}		
	}
}

///*******************************************************************************
//*函数名			:	function
//*功能描述		:	function
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	wegam@sina.com
//*******************************************************************************/
//static void Cab_Server(void)
//{
//	//--------------------------------------
//	//主板:接收PC数据，广播数据，内部使用和转发
//	//接收到总线数据，上传到PC
//	unsigned short 	rxnum=0;
//	unsigned char 	rxd[256];
//	stampphydef* 		frame=0;
//	//================================================数据接收
//	rxnum	=	RS485_ReadBufferIDLE(&ampRS485Cb,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
//	if(rxnum)
//	{
//		char ackflag=is_ack_frame(rxd,rxnum);	//1:向上应答，-1：向下应答；0:非应答
//		if(0!=ackflag)	//有应答
//		{
//			if(ampsys.AckW.CB)
//			{
//				if(((1==ampsys.sysdata.MB_Flag)&&(1==ackflag))			//主柜
//					||((0==ampsys.sysdata.MB_Flag)&&(-1==ackflag)))		//副柜
//				{
//					ampsys.AckW.CB	=	0;
//					ampsys.ReSend.Pc	=	0;
//					ampsys.time.PcSendTime	=	0;
//					AmpData_Cache_Releas(CabPort);
//				}
//			}
//			return;
//		}
//		Cab_Data_Process(rxd,rxnum);
//		return;
//	}
//	//================================================数据发送
//	
//	if(0==ampsys.time.CabSendTime)
//	{
//		unsigned short sendnum=0;
//		ampCachedef*	Cache;
//		//----------------------------------------------检查有无应答数据要发送
//		if(ampsys.CCdata.CbAck.size)
//		{
//			Cache	=	&ampsys.CCdata.CbAck;
//			sendnum	=	API_USART_DMA_Send(ampCommPcPort,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
//			if(sendnum)	//已将数据转移到缓存
//			{	
//				ampsys.CCdata.CbAck.size	=	0;	//0--无需等待应答，1--需等待应答
//				ampsys.time.PcSendTime		=	ampReSendTime;
//			}
//			return;
//		}
//		//----------------------------------------------发送数据
//		if(ampsys.ReSend.Cab>ampMaxResendCount)
//		{
//			ampsys.ReSend.Cab	=	0;
//			AmpData_Cache_Releas(CabPort);
//		}
//		Cache	=	AmpData_Cache_Get(CabPort);
//		if(0==Cache)	//无数据
//		{
//			ampsys.ReSend.Cab	=	0;
//			return;
//		}
//		sendnum	=	RS485_DMASend(&ampRS485Cb,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
//		if(sendnum)	//已将数据转移到缓存
//		{	
//			ampsys.AckW.CB	=	1;
//			ampsys.ReSend.Cab++;			
//			ampsys.time.CabSendTime	=	ampReSendTime;
//		}		
//	}
//}
///*******************************************************************************
//*函数名			:	function
//*功能描述		:	function
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	wegam@sina.com
//*******************************************************************************/
//static void Lay_Server(void)
//{
//	//--------------------------------------
//	//主板:接收PC数据，广播数据，内部使用和转发
//	//接收到总线数据，上传到PC
////	static unsigned short sendtime=0;
//	unsigned short rxnum=0;
//	unsigned char rxd[256];
//	stampphydef* frame=0;
//	//================================================数据接收
//	rxnum	=	RS485_ReadBufferIDLE(&ampRS485Ly,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
//	if(rxnum)
//	{
//		char ackflag=is_ack_frame(rxd,rxnum);	//1:向上应答，-1：向下应答；0:非应答
//		if((0!=ackflag)&&(ampsys.AckW.LY))
//		{
//			if((1==ackflag)&&(ampsys.AckW.LY))
//			{
//				ampsys.AckW.LY	=	0;
//				ampsys.ReSend.Lay	=	0;
//				AmpData_Cache_Releas(LayPort);
//			}
//			return;
//		}			
//	}
//	//================================================数据发送
//	if(0==ampsys.time.LaySendTime)
//	{
//		unsigned short sendnum=0;
//		ampCachedef*	Cache;
//		if(ampsys.ReSend.Lay>ampMaxResendCount)
//		{
//			ampsys.ReSend.Lay	=	0;
//			AmpData_Cache_Releas(LayPort);
//		}
//		Cache	=	AmpData_Cache_Get(LayPort);
//		if(0==Cache)	//无数据
//		{
//			ampsys.ReSend.Lay	=	0;
//			return;
//		}
//		sendnum	=	RS485_DMASend(&ampRS485Ly,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
//		if(sendnum)	//已将数据转移到缓存
//		{	
//			ampsys.AckW.LY=1;
//			ampsys.ReSend.Lay++;			
//			ampsys.time.LaySendTime	=	ampReSendTime;
//		}		
//	}
//}
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void pc_data_process(unsigned char* pBuffer,unsigned short len)
{  
	unsigned char 	cab_addr	=	0;	//柜地址
	unsigned char 	lay_addr	=	0;	//层地址
	unsigned short	Saved_len	=	0;
	ampphydef* frame	=	api_get_frame(pBuffer,len);
	if(0==frame)
		return;
	
	cab_addr	=	frame->msg.addr.address1;	//柜地址
	lay_addr	=	frame->msg.addr.address2;	//层地址
	//------------------------------PC应答
//	if(AmpCmdAck==frame->msg.cmd.cmd)		//应答，删除一缓存
//	{
//		ampsys.ReSend.Pc	=	0;
//		AmpData_Cache_Releas(PcPort);
//	}
	
