quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3/AMP01V11A3 - 副本 (2).C
	//------------------------------PC数据
	if(0xFF==cab_addr)	//广播数据
	{
		Saved_len	=	 set_cache_data(CabPort,frame);			//发往其它柜
		if(0!=lay_addr)
			Saved_len	=	 set_cache_data(LayPort,frame);		//发往本柜层板
	}
	else if(cab_addr	==	ampsys.sysdata.Cab_Addr)	//本柜数据
	{
		if(0!=lay_addr)
			Saved_len	=	 set_cache_data(LayPort,frame);		//发往本柜层板
	}
	else
	{
		Saved_len	=	 set_cache_data(CabPort,frame);			//发往其它柜
	}
	if(0==Saved_len)	//缓存满
	{
		return;
	}
	cmd_process(frame);			//命令处理
	amp_ack_up(PcPort);
}
///*******************************************************************************
//* 函数名			:	Cmd_Process
//* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
//* 输入			: void
//* 返回值			: void
//* 修改时间		: 无
//* 修改内容		: 无
//* 其它			: wegam@sina.com
//*******************************************************************************/
//static void Cab_Data_Process(unsigned char* pBuffer,unsigned short len)
//{  
//	unsigned char 	cab_addr	=	0;	//柜地址
//	unsigned char 	lay_addr	=	0;	//层地址
//	unsigned short	Saved_len	=	0;
//	stampphydef* frame	=	(stampphydef*)API_Get_AmpFrame(pBuffer,len);
//	if(0==frame)
//		return;
//	
//	cab_addr	=	frame->msg.addr.address1;	//柜地址
//	lay_addr	=	frame->msg.addr.address2;	//层地址
//	//------------------------------PC应答
//	if(AmpCmdAck==frame->msg.cmd.cmd)		//应答，删除一缓存
//	{
//		ampsys.ReSend.Pc	=	0;
//		AmpData_Cache_Releas(CabPort);
//	}
//	//------------------------------上报的数据
//	if(0!=frame->msg.cmd.dir)
//	{
//		Saved_len	=	 AmpData_Cache_Add(PcPort,frame);		//发往本柜层板
//		if(0!=ampsys.sysdata.MB_Flag)	//此为主板，需要向下应答
//		{
//			//应答
//			return;
//		}
//	}
//	//------------------------------数据处理
//	if((0xFF==cab_addr)||(cab_addr==ampsys.sysdata.Cab_Addr))	//广播数据/本柜数据
//	{
//		if(0!=lay_addr)
//			Saved_len	=	 AmpData_Cache_Add(LayPort,frame);		//发往本柜层板
//	}
//	if(0==Saved_len)	//缓存满
//	{
//		return;
//	}
//	Cmd_Process(frame);			//命令处理
//}
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void cmd_process(ampphydef* frame)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0; 
  unsigned  char  Cmd         = 0;  
////  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
//  stampphydef* ampframe=NULL;
  //-------------------------检查端口是否为层接口及缓存地址是否为空
  if(NULL==frame)
		return;
	//-------------------------
	Cmd	=	frame->msg.cmd;

  //2)-----------------层地址为0，不需要往下发，只在柜控制板处理：灯控制/锁控制/供电
  if((ampCmdLcdConf == Cmd)||(ampCmdLcdData==Cmd))       //LCD配置命令
  {
    ampLayPowerOn;    //层板供电
  }
	else if((ampCmdLed==Cmd)||(ampCmdLcdPwr==Cmd)||(ampCmdPwr==Cmd))  //LED电源供电控制指令
  {
    if(frame->msg.data[0])
		{
      ampLayPowerOn;    //层板供电
			ampBakkLightOn;
		}
    else
		{
      ampLayPowerOff;    //层板断电
			ampBakkLightOff;
		}			
  }
  else if(ampCmdLock ==  Cmd)   //锁控制命令
  {
    if(frame->msg.data[0])	//data0不为0表示要开锁
      Set_Lock_Open();
  }
  else if(ampCmdBKligth ==  Cmd)   //背光控制指令
  {
    if(frame->msg.data[0])	//data0不为0表示要开灯，否则关灯
      ampBakkLightOn;
    else
      ampBakkLightOff;    
  }
  else if(ampCmdSta ==  Cmd)   //查询状态
  {
    if(0==ampsys.Sta.lockstd) //开状态
    {
//      LockStatusUpdata(AmpCmdSta,AmpLockOpen);  //锁---开状态
    }
    else
    {
//      LockStatusUpdata(AmpCmdSta,AmpLockOn);  	//锁---关状态
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void amp_ack_up(ampPortDef port)
{
	ampCachedef*	Cache;
	if(PcPort	==	port)
		Cache	=	&ampsys.CCdata.PcAck;
	else if(CabPort	==	port)
		Cache	=	&ampsys.CCdata.CbAck;
	else if(LayPort	==	port)
		Cache	=	&ampsys.CCdata.LyAck;
	else
		return;
	Cache->arry	=	1;
	Cache->size	=	7;
	Cache->data[0]=0x7E;
	Cache->data[1]=0x02;
	Cache->data[2]=0x81;
	Cache->data[3]=0x00;
	Cache->data[4]=0xB0;
	Cache->data[5]=0x50;
	Cache->data[6]=0x7F;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void amp_ack_down(ampPortDef port)
{
	ampCachedef*	Cache;
	if(PcPort	==	port)
		Cache	=	&ampsys.CCdata.PcAck;
	else if(CabPort	==	port)
		Cache	=	&ampsys.CCdata.CbAck;
	else if(LayPort	==	port)
		Cache	=	&ampsys.CCdata.LyAck;
	else
		return;
	
	Cache->arry	=	1;
	Cache->size	=	7;
	Cache->data[0]=0x7E;
	Cache->data[1]=0x02;
	Cache->data[2]=0x01;
	Cache->data[3]=0x00;
	Cache->data[4]=0xD1;
	Cache->data[5]=0x90;
	Cache->data[6]=0x7F;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	1:向上应答，-1：向下应答；0:非应答
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static char is_ack_frame(unsigned char* pBuffer,unsigned short len)
{
	ampphydef* frame	=	(ampphydef*)api_get_frame(pBuffer,len);
	if(frame)
	{
		unsigned char dir	=	frame->msg.cmd&0x80;
		ampcmddef			cmd	=	frame->msg.cmd&0x7F;
		if(ampCmdAck	==	cmd)
		{
			if(0x00==frame->msg.cmd)	//向下应答
				return	1;
			else if(0x01==frame->msg.cmd)	//向上应答
				return -1;
		}
		else
			return 0;
	}
	return 0;
}
////=================================锁相关程序=================================

///*******************************************************************************
//*函数名			:	function
//*功能描述		:	function
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	wegam@sina.com
//*******************************************************************************/
//static void Lock_Server(void)
//{
//	if(ampsys.time.LockTime>0)
//	{
//		if(ampsys.time.LockTime<ampUnlockOuttime-100)
//		{
//			ampsys.lock.sta	=	1;//0--锁为开状态，1--锁住状态
//			if(ampGetLockSts)	//锁未打开
//			{
//				ampUnLock;
//			}
//			else if(ampsys.time.LockTime>200)
//			{
//				ampsys.time.LockTime	=	200-1;	//延迟500ms释放锁
//			}
//		}
//		else
//		{
//			ampUnLock;
//		}
//	}
//	else
//	{
//		ampResLock;
//		if(0!=ampsys.lock.que)		//请求开锁
//		{
//			if(ampGetLockSts)	//锁未打开
//			{
//				ampResLock;
////				LockStatusUpdata(AmpCmdLock,AmpLockOpenFailed);  //开锁失败
//				ampsys.lock.sta	=	1;//0--锁为开状态，1--锁住状态
//			}
//			else	//开锁失败
//			{
//				ampResLock;
////				LockStatusUpdata(AmpCmdLock,AmpLockOpen);  //锁已打开
//				ampBakkLightOn;
//				ampsys.lock.sta	=	0;//0--锁为开状态，1--锁住状态
//			}
//			ampsys.lock.que	=	0;	//清除开锁请求
//		}
//		else	//手动开锁
//		{
//			if(ampGetLockSts)
//			{
//				if(0==ampsys.lock.sta)	//关闭门
//				{
//					ampBakkLightOff;
//					ampLayPowerOff;
////					LockStatusUpdata(AmpCmdLock,AmpLockOn);  //锁已关闭
//					ampsys.lock.sta	=	1;//0--锁为开状态，1--锁住状态
//				}
//			}
//			else		//手动开锁
//			{
//				if(1==ampsys.lock.sta)	//原来为关闭状态
//				{
//					ampBakkLightOn;
////					LockStatusUpdata(AmpCmdLock,AmpLockOpen);  //锁已打开
//					ampsys.lock.sta	=	0;//0--锁为开状态，1--锁住状态
//				}			
//			}
//		}
//	}
//}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Set_Lock_Open(void)
{
	ampsys.lock.que	=	1;
	ampsys.time.LockTime	=	ampUnlockOuttime;	//开锁时间2秒
  ampUnLock;
}
////=======================================拨码开关===============================

///*******************************************************************************
//*函数名			:	function
//*功能描述		:	function
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	wegam@sina.com
//*******************************************************************************/
//static void SwitchID_Server(void)
//{
//  static unsigned char id=0;
//  static unsigned char power_on_flag=0; //上电时为0

//	if(0!=ampsys.time.swicthidtime)
//		return;
//	ampsys.time.swicthidtime	=	2000;
//  if(0==power_on_flag)  //刚上电
//  {
//    power_on_flag = 1;  //已上电完成
//    id  = SWITCHID_ReadLeft(&ampSwitchID)&0x3F;
//  }
//  else
//  {
//		unsigned char new_id  = 0;
//		new_id  = SWITCHID_ReadLeft(&ampSwitchID)&0x3F;
//		if(id != new_id)  //重新初始化
//		{
//			power_on_flag = 0;
//		}
//  }
//}

////=======================================通讯LED指示灯=============================

