quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V11A3/AMP01V11A3 - 副本 (2).C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Server(void)
{
  static unsigned short freshen_led_time=0;
  static unsigned char led_stata=0;
  if(freshen_led_time++>10)
  {
		freshen_led_time	=	0;
    led_stata++;
		//____________使能片选
		SPI_CS_LOW(&stLed);
		SPI_I2S_SendData(stLed.Port.SPIx, led_stata);				//发送数据
//    SPI_ReadWriteByteSPI(&stLed,led_stata);
		//____________取消片选	
		SPI_CS_HIGH(&stLed);
  }  
}




////=================================硬件接口End=============================================================


////=================================配置函数End=============================================================


////=================================时间函数ST==============================================================

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Tim_Server(void)
{
  //----------------PC发送
  if(ampsys.time.PcSendTime>0)
  {
    ampsys.time.PcSendTime--;
  }
  //----------------柜发送
  if(ampsys.time.CabSendTime>0)
  {
    ampsys.time.CabSendTime--;
  }
  //----------------层发送
  if(ampsys.time.LaySendTime>0)
  {
    ampsys.time.LaySendTime--;
  }
  //----------------读卡器发送
  if(ampsys.time.CardSendTime>0)
  {
    ampsys.time.CardSendTime--;
  }
  //----------------锁
  if(ampsys.time.LockTime>0)
  {
    ampsys.time.LockTime--;
  }
  //----------------拨码
  if(ampsys.time.swicthidtime>0)
  {
    ampsys.time.swicthidtime--;
  }
  //----------------运行指示灯
  if(ampsys.time.SYSLEDTime>0)
  {
    ampsys.time.SYSLEDTime--;
  }
	//----------------运行指示灯
  if(ampsys.time.BackLightTime>0)
  {
    ampsys.time.BackLightTime--;
  }	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Hardware_Configuration(void)
{
  BackLight_Configuration();
	LayPower_Configuration();
	Lock_Configuration();
  SwitchID_Configuration();
  Led_Configuration();
  Communication_Configuration();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Communication_Configuration(void)
{
	IOT5302Wdef ampIOT5302W;
  //-----------------------------PC接口USART1
  USART_DMA_ConfigurationNR	(ampCommPcPort,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断
  
  //-----------------------------读卡器接口USART3
  ampIOT5302W.Conf.IOT5302WPort.USARTx  = ampCommCardPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_CTL_PORT  = ampCommCardCTLPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_CTL_Pin   = ampCommCardCTLPin;
  ampIOT5302W.Conf.USART_BaudRate  = ampCommCardBaudRate;
	GPIO_Configuration_OOD50(GPIOC,GPIO_Pin_7);			//将GPIO相应管脚配置为OD(开漏)输出模式，最大速度50MHz----V20170605
	GPIO_ResetBits(GPIOC,GPIO_Pin_7);
  API_IOT5302WConfiguration(&ampIOT5302W);
  //-----------------------------层板接口USART2
  ampRS485Ly.USARTx  = ampCommLayPort;
  ampRS485Ly.RS485_CTL_PORT  = ampCommLayCTLPort;
  ampRS485Ly.RS485_CTL_Pin   = ampCommLayCTLPin;
  RS485_DMA_ConfigurationNR			(&ampRS485Ly,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	GPIO_Configuration_OOD50(GPIOA,GPIO_Pin_11);			//将GPIO相应管脚配置为OD(开漏)输出模式，最大速度50MHz----V20170605
	GPIO_ResetBits(GPIOA,GPIO_Pin_11);
  //-----------------------------副柜接口UART4
  ampRS485Cb.USARTx  = ampCommCbPort;
  ampRS485Cb.RS485_CTL_PORT  = ampCommCbCTLPort;
  ampRS485Cb.RS485_CTL_Pin   = ampCommCbCTLPin;
  RS485_DMA_ConfigurationNR			(&ampRS485Cb,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	GPIO_Configuration_OOD50(GPIOC,GPIO_Pin_9);			//将GPIO相应管脚配置为OD(开漏)输出模式，最大速度50MHz----V20170605
	GPIO_ResetBits(GPIOC,GPIO_Pin_9);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void SwitchID_Configuration(void)
{
  ampSwitchID.NumOfSW	=	8;
  
  ampSwitchID.SW1_PORT	=	GPIOB;
  ampSwitchID.SW1_Pin	=	GPIO_Pin_9;
  
  ampSwitchID.SW2_PORT	=	GPIOB;
  ampSwitchID.SW2_Pin	=	GPIO_Pin_8;
  
  ampSwitchID.SW3_PORT	=	GPIOB;
  ampSwitchID.SW3_Pin	=	GPIO_Pin_7;
  
  ampSwitchID.SW4_PORT	=	GPIOB;
  ampSwitchID.SW4_Pin	=	GPIO_Pin_6;
  
  ampSwitchID.SW5_PORT	=	GPIOB;
  ampSwitchID.SW5_Pin	=	GPIO_Pin_5;
  
  ampSwitchID.SW6_PORT	=	GPIOB;
  ampSwitchID.SW6_Pin	=	GPIO_Pin_4;
  
  ampSwitchID.SW7_PORT	=	GPIOB;
  ampSwitchID.SW7_Pin	=	GPIO_Pin_3;
  
  ampSwitchID.SW8_PORT	=	GPIOD;
  ampSwitchID.SW8_Pin	=	GPIO_Pin_2;

	SwitchIdInitialize(&ampSwitchID);						//

  ampsys.sysdata.Cab_Addr  = SWITCHID_ReadLeft(&ampSwitchID)&0x3F;  
  
  if(SWITCHID_ReadLeft(&ampSwitchID)&0x80)
  {
    ampsys.sysdata.MB_Flag=1; //0--副柜，1--主柜
  }
  else
  {
    ampsys.sysdata.MB_Flag=0; //0--副柜，1--主柜
  }
}
//=================================背光相关程序=================================
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BackLight_Configuration(void)
{
  GPIO_Configuration_OPP50(ampBackLightPort,ampBackLightPin);
  ampBakkLightOff;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void LayPower_Configuration(void)
{
  GPIO_Configuration_OPP50(ampLayPowerPort,ampLayPowerPin);
  ampLayPowerOff;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lock_Configuration(void)
{
  GPIO_Configuration_OPP50(ampLockDrPort,ampLockDrPin);
  GPIO_Configuration_IPU(ampLockDrPort,ampLockDrPin);
  ampResLock;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Led_Configuration(void)
{
  stLed.Port.SPIx 			= SPI1;
  stLed.Port.CS_PORT  	= GPIOA;
  stLed.Port.CS_Pin   	= GPIO_Pin_4;
  stLed.Port.CLK_PORT 	= GPIOA;
  stLed.Port.CLK_Pin  	= GPIO_Pin_5;
  stLed.Port.MISO_PORT  = GPIOA;
  stLed.Port.MISO_Pin   = GPIO_Pin_6;
  stLed.Port.MOSI_PORT  = GPIOA;
  stLed.Port.MOSI_Pin   = GPIO_Pin_7;
  stLed.Port.SPI_BaudRatePrescaler_x  = SPI_BaudRatePrescaler_64;
	SPI_Initialize(&stLed);		//SPI接口配置
  //SPI_InitializeSPI(&stLed);			//SPI-DMA通讯方式配置
}
#endif
